AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/Templates/case/0/ReThetat
%{%(physics/Turbulence%)
%:RANS
%{%(physics/TurbulenceModel%)
%:kOmegaSSTLM
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ReThetat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform %(initialValues/ReThetat%);

boundaryField
{
%[0/_boundary_MMR_scalar%]

%{%(boundaries%)
%{%(boundaries/%(0%)/BoundaryType%)
%:empty
%[0/_boundary_empty%]
%:wall
%{%(boundaries/%(0%)/BoundarySubType%)
%:fixedWall translatingWall rotatingWall partialSlipWall roughWall
    %(0%)
    {
        type        zeroGradient;
    }
%:slipWall
%[0/_boundary_zeroGradient%]
%}
%:inlet open
%{%(boundaries/%(0%)/TurbulenceInletSpecification%)
%:TKESpecDissipationRateGammaAndReThetat intensityAndLengthScale
    %(0%)
    {
        type        inletOutlet;
        inletValue  uniform %(boundaries/%(0%)/ReThetat%);
        value       $internalField;
    }
%}
%:outlet
    %(0%)
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }
%:constraint
%[0/_boundary_constraint%]
%:baffle
%[0/_boundary_cyclic_baffle%]
%}

%}
%[0/_boundary_redistributeHelper%]
}

// ************************************************************************* //
%}
%}
