AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/Templates/case/0/alphat
%{%(solver/SolverName%)
%:buoyantSimpleFoam buoyantPimpleFoam hisa
%{%(physics/Turbulence%)
%:RANS DES LES
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
%[0/_boundary_MMR_scalar%]

%{%(boundaries%)
%{%(boundaries/%(0%)/BoundaryType%)
%:wall
%{%(boundaries/%(0%)/BoundarySubType%)
%:fixedWall translatingWall rotatingWall partialSlipWall
    %(0%)
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }
%:slipWall
%[0/_boundary_zeroGradient%]
%:roughWall
    %(0%)
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }
%}
%:constraint
%[0/_boundary_constraint%]
%:baffle
%[0/_boundary_cyclic_baffle%]
%:default
%[0/_boundary_calculated%]
%}

%}
%[0/_boundary_redistributeHelper%]
}

// ************************************************************************* //
%}
%}
