AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/Templates/case/Allrun.ps1
function runCommand([string]$cmd)
{
    $sol = (Split-Path -Leaf $cmd)
    & $cmd $args 2>&1 | tee log.$sol
    $err = $LASTEXITCODE
    if( ! $LASTEXITCODE -eq 0 )
    {
        exit $err
    }
}

function runParallel([int]$NumProcs, [string]$cmd)
{
    $sol = (Split-Path -Leaf $cmd)
%{%(system/hostFileRequired%)
%:False
    & mpiexec %(system/MPIOptionsMSMPI%) -np $NumProcs $cmd -parallel $args 2>&1 | tee log.$sol
%:True
    & mpiexec %(system/MPIOptionsMSMPI%) --hostfile %(system/hostFileName%) -np $NumProcs $cmd -parallel $args 2>&1 | tee log.$sol
%}
    $err = $LASTEXITCODE
    if( ! $LASTEXITCODE -eq 0 )
    {
        exit $err
    }
}

# Set piping to file to ascii
$PSDefaultParameterValues['Out-File:Encoding'] = 'ascii'

# Copy mesh from mesh case dir if available
$MESHDIR = "%(meshDir%)"
if( Test-Path -PathType Leaf $MESHDIR/constant/polyMesh/faces )
{
    rm -ErrorAction SilentlyContinue -Recurse -Force constant/polyMesh
    cp -Recurse $MESHDIR/constant/polyMesh constant/polyMesh
}
elseif( !(Test-Path -PathType Leaf constant/polyMesh/faces) )
{
    throw "Fatal error: Unable to find mesh in directory $MESHDIR"
}

# Set turbulence lib
if ( $Env:WM_PROJECT_VERSION[0] -eq "v" -or 10 -gt $Env:WM_PROJECT_VERSION )
{
    echo '"libturbulenceModels"' > system/turbulenceLib
}
else
{
    echo '"libmomentumTransportModels"' > system/turbulenceLib
}

# Set interface compression
echo "div(phi,alpha) Gauss vanLeer;" > system/alphaDivScheme
echo "cAlpha 1;" > system/cAlpha

%{%(dynamicMeshEnabled%)
%:True
# Set 'internal' patch type
mkdir 0/include
if ( $Env:WM_PROJECT_VERSION[0] -eq "v" -or 9 -gt $Env:WM_PROJECT_VERSION )
{
    echo "type fixedValue;" > 0/include/helperPatchFieldType
    echo "type patch;" > system/helperPatchType
}
else
{
    echo "type internal;" > 0/include/helperPatchFieldType
    echo "type internal;" > system/helperPatchType
}

%}
%{%(MovingMeshRegionsPresent%)
%:True
mkdir 0/MMR
if( (Get-Command createNonConformalCouples) )
{
    echo 'type movingWallSlipVelocity;' > 0/MMR/vector
    echo 'value $internalField;' >> 0/MMR/vector

    echo 'type zeroGradient;' > 0/MMR/scalar

    echo 'type calculated;' > 0/MMR/calculated
    echo 'value uniform 0;' >> 0/MMR/calculated
}
else
{
    echo 'type cyclicAMI;' > 0/MMR/scalar
    echo 'type cyclicAMI;' > 0/MMR/vector
    echo 'type cyclicAMI;' > 0/MMR/calculated
    echo 'value $internalField;' >> 0/MMR/scalar
    echo 'value $internalField;' >> 0/MMR/vector
    echo 'value $internalField;' >> 0/MMR/calculated
}

%}
%{%(scalarTransportFunctionsEnabled%)
%:True
# Enable fvOption source for scalar transport in OpenFOAM v10+
if ( $Env:WM_PROJECT_VERSION[0] -ne "v" -and 10 -le $Env:WM_PROJECT_VERSION )
{
    cp system/fvOptionsScalarTransport_OF10 system/fvOptionsScalarTransport
}

%}
# Update patch name and type
runCommand createPatch -overwrite

%{%(zonesPresent%)
%:True
# Set cell zones contained inside the .stl surfaces
runCommand topoSet -dict system/topoSetZonesDict

%}
%{%(initialisationZonesPresent%)
%:True
# Set internal fields according to setFieldsDict
runCommand setFields

%}
%{%(bafflesPresent%)
%:True
%{%(createPatchesFromSnappyBaffles%)
%:False
# Combine mesh faceZones
runCommand topoSet -dict system/topoSetBafflesDict

# Creating baffles
runCommand createBaffles -overwrite

%}
%}
%{%(runChangeDictionary%)
%:True
# Update patch name and type
runCommand changeDictionary

%}
%{%(initialValues/PotentialFlow%)
%:True
%{%(solver/SolverName%)
%:buoyantSimpleFoam buoyantPimpleFoam interFoam multiphaseInterFoam
$PNAME = "p_rgh"
%:default
$PNAME = "p"
%}

%}
%{%(solver/Parallel%)
%:True
# Parallel decomposition
if( !(Test-Path -PathType Container processor0) )
{
    runCommand decomposePar -force
}

# Pick up number of parallel processes
$NPROC = foamDictionary -entry "numberOfSubdomains" -value system/decomposeParDict

%{%(dynamicMeshEnabled%)
%:False
%{%(MovingMeshRegionsPresent%)
%:False
# Mesh renumbering
runParallel $NPROC renumberMesh -overwrite
%}
%:True
# Mesh renumbering does not work in Foundation with dynamic mesh
# runParallel $NPROC renumberMesh -overwrite
%}

%{%(initialValues/PotentialFlow%)
%:True
# Initialise flow
%{%(bafflesPresent%)
%:True
# Baffle BC does not work with potentialFoam; do not initialise p
runParallel $NPROC potentialFoam -initialiseUBCs -pName $PNAME
%:default
%{%(initialValues/PotentialFlowP%)
%:True
runParallel $NPROC potentialFoam -initialiseUBCs -pName $PNAME -writep
%:default
runParallel $NPROC potentialFoam -initialiseUBCs -pName $PNAME
%}
%}
%{%(solver/SolverName%)
%:buoyantSimpleFoam buoyantPimpleFoam interFoam multiphaseInterFoam
# Remove phi with wrong units
rm -ErrorAction SilentlyContinue processor*/0/phi
%}

%}
# Run application in parallel
# Detect new foamRun in Foundation versions >= 11 and translate solver
if( (Get-Command -ErrorAction SilentlyContinue foamRun) )
{
%{%(solver/SolverName%)
%:simpleFoam pimpleFoam
    runParallel $NPROC foamRun -solver incompressibleFluid
%:buoyantSimpleFoam buoyantPimpleFoam
    runParallel $NPROC foamRun -solver fluid
%:interFoam
    runParallel $NPROC foamRun -solver incompressibleVoF
%:multiphaseInterFoam
    runParallel $NPROC foamRun -solver incompressibleMultiphaseVoF
%:default
    runParallel $NPROC %(solver/SolverName%)
%}
}
else
{
    runParallel $NPROC %(solver/SolverName%)
}
%:False
%{%(dynamicMeshEnabled%)
%:False
# Mesh renumbering
runCommand renumberMesh -overwrite
%:True
# Mesh renumbering does not currently work in Foundation with dynamic mesh
# runCommand renumberMesh -overwrite
%}

%{%(initialValues/PotentialFlow%)
%:True
# Initialise flow
%{%(bafflesPresent%)
%:True
# Baffle BC does not work with potentialFoam; do not initialise p
runCommand potentialFoam -initialiseUBCs -pName $PNAME
%:default
%{%(initialValues/PotentialFlowP%)
%:True
runCommand potentialFoam -initialiseUBCs -pName $PNAME -writep
%:default
runCommand potentialFoam -initialiseUBCs -pName $PNAME
%}
%}
%{%(solver/SolverName%)
%:buoyantSimpleFoam buoyantPimpleFoam interFoam multiphaseInterFoam
# Remove phi with wrong units
rm -ErrorAction SilentlyContinue 0/phi
%}

%}
# Run application
# Detect new foamRun in Foundation versions >= 11 and translate solver
if( (Get-Command foamRun) )
{
%{%(solver/SolverName%)
%:simpleFoam pimpleFoam
    runCommand foamRun -solver incompressibleFluid
%:buoyantSimpleFoam buoyantPimpleFoam
    runCommand foamRun -solver fluid
%:interFoam
    runCommand foamRun -solver incompressibleVoF
%:multiphaseInterFoam
    runCommand foamRun -solver incompressibleMultiphaseVoF
%:default
    runCommand %(solver/SolverName%)
%}
}
else
{
    runCommand %(solver/SolverName%)
}
%}
