AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/Templates/case/constant/momentumTransport
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "turbulenceProperties"