AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/Templates/case/system/fvOptions
%{%(fvOptionsPresent%)
%:True
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

%{%(porousZonesPresent%)
%:True
%{%(solver/SolverName%)
%:porousSimpleFoam
%:default
%{%(porousZones%)
%{%(porousZones/%(0%)/PartNameList%)
%(0%)
{
    type            explicitPorositySource;
    active          yes;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        %(0%);

        type            DarcyForchheimer;

        DarcyForchheimerCoeffs
        {
            d   d [0 -2 0 0 0 0 0] (%(porousZones/%(1%)/D%));
            f   f [0 -1 0 0 0 0 0] (%(porousZones/%(1%)/F%));

            coordinateSystem
            {
                type    cartesian;
                origin  (0 0 0);
                coordinateRotation
                {
                    type    axesRotation;
                    e1      (%(porousZones/%(1%)/e1%));
                    e3      (%(porousZones/%(1%)/e3%));
                }
            }
        }
    }
}

%}
%}
%}
%}

#includeIfPresent "fvOptionsScalarTransport"

%{%(meanVelocityForceEnabled%)
%:True
momentumSource
{
    type            meanVelocityForce;
    selectionMode   all;
    active          yes;
    meanVelocityForceCoeffs
    {
        selectionMode   all;
        fields          (U);
        direction       (%(meanVelocityForce/Direction%));
        Ubar            (%(meanVelocityForce/Ubar%));
        relaxation      %(meanVelocityForce/Relaxation%);
    }
}

%}
%{%(meanVelocityForceCellZonesPresent%)
%:True
%{%(meanVelocityForceCellZones%)
%{%(meanVelocityForceCellZones/%(0%)/PartNameList%)
%(0%)MomentumSource
{
    type            meanVelocityForce;
    selectionMode   cellZone;
    cellZone        %(0%);
    active          yes;
    meanVelocityForceCoeffs
    {
        selectionMode   cellZone;
        cellZone        %(0%);
        fields          (U);
        direction       (%(meanVelocityForceCellZones/%(1%)/Direction%));
        Ubar            (%(meanVelocityForceCellZones/%(1%)/Ubar%));
        relaxation      %(meanVelocityForceCellZones/%(1%)/Relaxation%);
    }
}

%}
%}
%}
//************************************************************************ //
%}
